---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.LayoutRule
source: html/bff8d973-7a55-e9c4-dab5-ff15c3242ec4.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.LayoutRule Property

Identifies the layout rule of rebar set.

## Syntax (C#)
```csharp
public RebarLayoutRule LayoutRule { get; }
```